tutorials/Darcy_Flow_Cases/Regular2DBox/Single_Phase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application hybridPorousPimpleFoam;
startFrom latestTime;
startTime 0;
stopAt endTime;
endTime 6912000000; //86400000000
deltaT 864000;
adjustTimeStep yes;
maxCo           0.8; 
maxDeltaT       86400000; 
writeControl adjustableRunTime;
writeInterval 86400000;
purgeWrite 0;
writeFormat ascii;
writePrecision 6;
writeCompression off;
timeFormat general;
timePrecision 14;
runTimeModifiable true;

functions
{
    #includeFunc scalarTransport
}