tutorials/Darcy_Flow_Cases/Regular2DBox/Single_Phase/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            htHydroThermo;
    mixture         pureMixture;
    transport       IAPWS;
    thermo          IAPWS; 
    equationOfState IAPWS;
    specie          specie;
    energy          temperature; 
}

mixture
{
    specie
    {
        molWeight       18;
    }
    porousMedia
    {
        porosity porosity [0 0 0 0 0 0 0] 0.1;
        kr kr [1 1 -3 -1 0 0 0] 1.5;
        cp_rock cp_rock [0 2 -2 -1 0 0 0] 880;
        rho_rock rho_rock [1 -3 0 0 0 0 0] 3000;
    }
}


// ************************************************************************* //
