tutorials/Darcy_Flow_Cases/Regular2DBox/Single_Phase/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 278.15;     //278.15 K = 5 C

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    top
    {
        //type            fixedValue;
        //value           uniform 273.15;
        type            inletOutlet;
        phi                     phi;
        inletValue      uniform 278.15;
    }
    bottom
    {
        type            codedFixedValue;
        value           uniform 873.15; 
        name            gaussShapeT;
        code            #{
                            scalarField x(this->patch().Cf().component(0)); 
                            double wGauss=200;
                            double x0=1000;
                            double Tmin=573;
                            double Tmax=873.15;
                            scalarField T(Tmin+(Tmax-Tmin)*exp(-(x-x0)*(x-x0)/(2*wGauss*wGauss)));
                            operator==(T);
                        #};
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
